<template>
  <div>
    <Header />
    <div class="container">
      <div class="news">
        <h2 class="news__title title">Новости</h2>
        <div class="news__items">
          <div
            class="news__item item"
            v-for="(news_item, index) in news"
            :key="news_item.id"
          >
            <img
              class="item__image"
              :src="require('../assets/news/' + news_item.image)"
              alt="Картинка новости"
            >
            <div class="item__text-wrapper">
              <p class="item__title subtitle">{{ news_item.title }}</p>
              <p class="item__text text">
                {{ news_item.text }}
                <transition name="show-text">
                  <span
                    class="item__text text"
                    v-if="news_item.showAllText"
                  >
                    {{ news_item.allText }}
                  </span>
                </transition>
              </p>
              <div class="item__bottom-row">
                <p class="item__date">{{ news_item.date }}</p>
                <button
                  @click="showText(index)"
                  class="item__button"
                >
                  <span v-if="!news_item.showAllText">Подробнее</span>
                  <span v-else>Скрыть</span>
                </button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <Footer />
  </div>
</template>

<script>
import Header from '../components/Header'
import Footer from '../components/Footer'

export default {
  components: {
    Header,
    Footer
  },
  data () {
    return {
      news: [
        {
          id: 1,
          image: 'apples.jpg',
          title: 'Заголовок 1',
          text: 'Cайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык.',
          allText: `Таким образом сложившаяся структура организации представляет собой интересный эксперимент проверки
                    систем массового участия. Товарищи! постоянный количественный рост и сфера нашей активности
                    представляет собой интересный эксперимент проверки модели развития. Разнообразный и богатый опыт новая
                    модель организационной деятельности способствует подготовки и реализации модели развития. Таким образом
                    дальнейшее развитие различных форм деятельности позволяет оценить значение направлений прогрессивного развития.
                    Таким образом укрепление и развитие структуры представляет собой интересный эксперимент проверки позиций,
                    занимаемых участниками в отношении поставленных задач.`,
          showAllText: false,
          date: '08.10.20'
        },
        {
          id: 2,
          image: 'building.jpg',
          title: 'Заголовок 2',
          text: 'Cайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке.',
          allText: `Таким образом сложившаяся структура организации представляет собой интересный эксперимент проверки
                    систем массового участия. Товарищи! постоянный количественный рост и сфера нашей активности
                    представляет собой интересный эксперимент проверки модели развития. Разнообразный и богатый опыт новая
                    модель организационной деятельности способствует подготовки и реализации модели развития. Таким образом
                    дальнейшее развитие различных форм деятельности позволяет оценить значение направлений прогрессивного развития.
                    Таким образом укрепление и развитие структуры представляет собой интересный эксперимент проверки позиций,
                    занимаемых участниками в отношении поставленных задач.`,
          showAllText: false,
          date: '22.10.20'
        },
        {
          id: 3,
          image: 'nuts.jpg',
          title: 'Заголовок 3',
          text: 'Cайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему.',
          allText: `Таким образом сложившаяся структура организации представляет собой интересный эксперимент проверки
                    систем массового участия. Товарищи! постоянный количественный рост и сфера нашей активности
                    представляет собой интересный эксперимент проверки модели развития. Разнообразный и богатый опыт новая
                    модель организационной деятельности способствует подготовки и реализации модели развития. Таким образом
                    дальнейшее развитие различных форм деятельности позволяет оценить значение направлений прогрессивного развития.
                    Таким образом укрепление и развитие структуры представляет собой интересный эксперимент проверки позиций,
                    занимаемых участниками в отношении поставленных задач.`,
          showAllText: false,
          date: '04.11.20'
        },
        {
          id: 4,
          image: 'citrus.jpg',
          title: 'Заголовок 4',
          text: 'Cайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке.',
          allText: `Таким образом сложившаяся структура организации представляет собой интересный эксперимент проверки
                    систем массового участия. Товарищи! постоянный количественный рост и сфера нашей активности
                    представляет собой интересный эксперимент проверки модели развития. Разнообразный и богатый опыт новая
                    модель организационной деятельности способствует подготовки и реализации модели развития. Таким образом
                    дальнейшее развитие различных форм деятельности позволяет оценить значение направлений прогрессивного развития.
                    Таким образом укрепление и развитие структуры представляет собой интересный эксперимент проверки позиций,
                    занимаемых участниками в отношении поставленных задач.`,
          showAllText: false,
          date: '29.11.20'
        }
      ]
    }
  },
  methods: {
    showText(index) {
      this.news.map(item => {
        if (item.id == index+1) {
          item.showAllText = !item.showAllText;
        }
      })
    }
  }
}  
</script>

<style lang="scss" scoped>
.news {
  margin-bottom: 120px;
  @include _768 {
    margin-bottom: 80px;
  }
  &__title {}
  &__items {
    display: flex;
    flex-wrap: wrap;
  }
  &__item {
    margin-bottom: 35px;
    width: 49%;
    @include _768 {
      width: 100%;
    }
    &:nth-child(odd) {
      margin-right: 2%;
      @include _768 {
        margin-right: 0;
      }
    }
  }
}

.item {
  &__image {
    margin-bottom: 10px;
    width: 100%;
  }
  &__text-wrapper {}
  &__title,
  &__text {
    margin-bottom: 8px;
  }
  &__bottom-row {
    display: flex;
    justify-content: space-between;
  }
  &__button {
    background-color: #fff;
    span {
      color: $green;
      cursor: pointer;
      transition: $transition;
      &:hover {
        color: $dark_green;
      }
    }
  }
  &__date {
    color: #bebebe;
  }
}

.show-text-enter-active,
.show-text-leave-active {
  transition: opacity .2s;
}
.show-text-enter,
.show-text-leave-to  {
  opacity: 0;
}
</style>